Revit 2027 API
DirectShapeType.AddReferenceCurve Method
Overload List
Name | Description
AddReferenceCurve(Curve) |  Adds a reference curve to the DirectShapeType.
AddReferenceCurve(Curve, DirectShapeReferenceOptions) |  Adds a reference curve to the DirectShapeType.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace